// Function ຄືຊຸດຄຳສັ່ງທີ່ນຳມາຂຽນລວມກັນເປັນກຸ່ມເພື່ອໃຫ້ເອີ້ນໃຊ້ງານ
// ຕາມວັດຖຸປະສົງທີ່ຕ້ອງການ ແລະ ລົດຄວາມຊັບຊ້ອນຂອງຄຳສັ່ງທີ່ໃຊ້ງານປະຈຳ
// Function ສາມາດນຳໄປໃຊ້ງານໄດ້ທຸດທີ່ ແລະ ແກ້ໄຂໄດ້ໃນພາຍຫຼັງ ເຮັດໃຫ້ Code ໃນໂປຣແກຣມມີລະບຽບ ແລະ ໃຊ້ງານໄດ້ສະດວກຫຼາຍຂື້ນ

// Function ຄືໂປຣແກຣມຍ່ອຍທີ່ນຳມາເປັນສ່ວນໝຶ່ງຂອງໂປຣແກຣມຫຼັກ ເພື່ອໃຫ້ສາມາດເອີ້ອນໃຊ້ງານ
// ໄດ້ໂດຍບໍ່ຈຳເປັນຕ້ອງຂຽນ Code ຄຳສັ່ງໃໝ່ທັງໝົດ

// function noy(){

// }

// noy();


// ຮູບແບບການຮັບຄ່າເຂົ້າມາເຮັດວຽກ
// function (parameter1,parameter2,...){
    //
// }

// argument ຄືຕົວແປ ຫຼື ຄ່າທີ່ຕ້ອງການສົ່ງໃຫ້ກັບ function
// parameter ຄືຕົວແປທີ່ function ສ້າງໄວ້ສຳຫຼັບຮັບຄ່າທີ່ຈະສົ່ງເຂົ້າມາໃຫ້ກັບ function

function number(x){
    console.log(x);
}

number(5);