// break ຖ້າໂປຣແກຣມພົບຄຳສັ່ງນີ້ຈະຫຼຸດອອກຈາກການເຮັດວຽກໃນ Loop
// ເພື່ອຈະໄປເຮັດຄຳສັ່ງອືີ່ນນອກ Loop

// continue ຄຳສັ່ງນີ້ຈະເຮັດໃຫ້ຢຸດການເຮັດວຽກແລ້ວຍ້ອນກັບໄປເລີ່ມຕົ້ນການເຮັດວຽກທີ່ຕົ້ນ Loop ໃໝ່

// ---------------------------------------

let count=1;

while(count<=3){
    console.log("Hello");
    if(count==4){
        break;
    }
    count++;
}

// ---------------------------------------

// for(ຄ່າເລີ່ມຕົ້ນຂອງຕົວແປ;ເງື່ອນໄຂ;ປ່ຽນແປງຄ່າຂອງຕົວແປ){
//     ຄຳສັ່ງເມື່ອເງື່ອນໄຂເປັນ True;
// }

for(let i=1;i<=10;i++){
    console.log("Hello");
}

// ---------------------------------------

let noy = 1;

do {
    console.log(noy);
    noy++;
} while (noy<=5);

// ---------------------------------------
// ຂໍ້ແຕກຕ່າງ ແລະ ການໃຊ້ງານ  Loop

//  - for ໃຊ້ໃນກໍລະນີຮູ້ຈຳນວນຮອບທີ່ຊັດເຈນ
//  - While ໃຊ້ໃນກໍລະນີທີ່ບໍ່ຮູ້ຈຳນວນຮອບ
//  - do..while ໃຊ້ໃນກໍລະນີທີ່ຢາກໃຫ້ລອງເຮັດກ່ອນ 1 ຮອບ ແລ້ວເຮັດໄປເລື່ອຍໆຈົນເທົ່າກັບເງື່ອນໄຂທີ່ເປັນ true