<!-- do..while 
ໂປຣແກຣມຈະທຳງານຕາມຄຳສັ່ງຢ່ງນ້ອຍ 1 ຮອບເມື່ອທຳງານແລ້ວຈະມາ
ກວດສອບເງື່ອນໄຂທີ່ຄຳສັ່ງ while ຖ້າເງື່ອນໄຂເປັນຈິງຈະວົນກັບຂື້ນໄປທຳງານທີ່
ຄຳສັ່ງໃໝ່ອີກຮອບ ແຕ່ຖ້າເປັນ false ຈະຫຼຸດອອກຈາກ ລູບ

ໂຄງສ້າງ
do{
    ຄຳສ່ັ່ງຕ່າງໆ ເມື່ອເງື່ອນໄຂເປັນຈິງ;
}while(ເງື່ອນໄຂ); -->

<?php
$num = 1;
$limit = 10;

do{
    echo "ຮອບທີ່ = ".$num."<br>";
    $num++;
}while($num<=$limit);
?>

<!-- ຄວາມແຕກຕ່າງຂອງ Loop

- For ໃຊ້ໃນກໍລະນີຮູ້ຈຳນວນຮອບທີ່ຊັດເຈນ
- While ໃຊ້ໃນກໍລະນີບໍ່ຮູ້ຈຳນວນຮອບ
- Do..While ໃຊ້ໃນກໍລະນີທີ່ຢາກໃຫ້ລອງເຮັດ 1 ຮອບແລ້ວວົນຊ້ຳໄປເລື່ອຍໆຈົນເງື່ອນໄຂເປັນຈິງ -->