<!-- - break ຖ້າໂປຮແກຣມພົບຄຳສັ່ງນີ້ຈະຫຼຸດຈາກການທຳງານໃນ ທັນທີ ເພື່ອໄປທຳງານຄຳສັ່ງອື່ນທີ່ຢູ່ນອກ
- continue ຄຳສັ່ງນີ້ຈະເຮັດໃຫ້ຢຸດການເຮັດວຽກແລ້ວ ຍ້ອນກັບໄປການທຳງານທີ່ຕົ້ນ ໃໝ່
- exit ຄຳສັ່ງນີ້ຈະເຮັດໃຫ້ໂປຣແກຣມຢຸດທຳງານ (ໃນກໍລະນີທີ່ມີຂໍ້ຜິດພາດເກີດຂື້ນໃນໂປຣແກຣມຈະອອກຈາກການທຳງານຂອງໂປຣແກຣມ) -->

<?php
for($i=1; $i<=10; $i++){
    echo "ຮອບ  =​ ".$i."<br>";
    if($i==5){
        break;
    }
  }

echo "Stop";
echo "______________";

for ($n=1; $n<=10; $n++){
    if($n == 5){
        continue;
    }
}
echo "ຮອບ = ".$n."<br>";

exit;
echo "END"
?>

