<!-- switch Case ເປັນຄຳສັ່ງທີ່ໃຊ້ກຳນົດເງື່ອນໄຂ ຄືກັບ if ແຕ່ຈະເລື່ອກພຽງທາງດຽວໂດຍນຳຄ່າຂອງຕົວແປ ມາກຳນົດເປັນທາງເລືອກຜ່ານຄຳສັ່ງ Case

ໂຄງສ້າງ
switch(){
    case ຄ່າທີ່1 : ຄຳສັ່ງທີ່1;
    break;
    case ຄ່າທີ່2 : ຄຳສັ່ງທີ່2;
    break;
    case ຄ່າທີ່ N : ຄຳສັ່ງທີ່ N;
    break;

    default : ຄຳສັ່ງທີ່ບໍ່ມີຄ່າຕົວກັບທີ່ລະບຸໄວ້ໃນ case ;
}

ຈະເຮັດໃຫ້ໂປຣແກຣມໂດດອອກໄປທຳງານນອກຄຳສັ່ງ switch  ຖ້າບໍ່ມີຄຳສັ່ງ break ໂປຣແກຣມຈະທຳງານຄຳສັ່ງຕໍ່ໄປເລື່ອຍໆ -->

<?php
/* 
5 years -> 10%
10 year -> 20%
*/

$years = 5;

switch($years){
    case 5 : echo "ໄລຍະກູ້ : ".$years."ດອກເບີ້ຍ 10%";
        break;
    case 10: echo "ໄລຍະກູ້ : ".$years."ດອກເບີ້ຍ 20%";
        break;
    default : echo "ບໍ່ຕົງກັບເງື່ອນໄຂທີ່ກຳນົດ";
}
?>