<!-- ຕົວດຳເນີນການປຽບທຽບ

ເທົ່າກັບ                 ==
ຄືກັນ                  ===
ບໍ່ເທົ່າກັບ               !=
ບໍ່ເທົ່າກັບ               <>
ບໍ່ຄືກັນ                !===
ຫຼາຍກວ່າ               >
ໜ້ອຍກວ່າ              <
ຫຼາຍກວ່າເທົ່າກັບ          >=
ໜ້ອຍກວ່າເທົ່າກັບ         >=
Spaceship (php7)      <=> 
-->

<?php
    $a = 500;
    $b = "500";
    var_dump($a == $b);//ເທົ່າກັນບໍ່
    var_dump($a === $b);//ຄືກັນບໍ່
    var_dump($a !== $b);//ບໍ່ຄືກັນບໍ່
    
    var_dump($a != $b);


    echo "<br> ຜົນການປຽບທຽບ : <br>".($a == $b);

    var_dump($a<=>$b);
?>